sftp 重构
